RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_smif.h
/***************************************************************************//**
* \file cy_smif.h
* \version 2.30
*
* Provides an API declaration of the Cypress SMIF driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2021 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_smif
* \{
* The SPI-based communication interface to the external quad SPI (QSPI) 
* high-speed memory devices.
*
* The functions and other declarations used in this driver are in cy_smif.h and 
* cy_smif_memslot.h (if used). If you are using the ModusToolbox QSPI Configurator, 
* also include cycfg_qspi_memslot.h. 
*
* **SMIF: Serial Memory Interface**: This IP block implements an SPI-based
* communication interface for interfacing external memory devices to PSoC.
* The SMIF supports SPI, dual SPI (DSPI), quad SPI (QSPI), dual QSPI and octal SPI.
* 
* Features
*   - Standard SPI Master interface
*   - Supports single/dual/quad/octal SPI memory devices
*   - Supports dual quad SPI mode
*   - Design-time configurable support for multiple (up to 4) external serial
*   memory devices
*   - eXecute-In-Place (XIP) operation mode for both read and write accesses
*   with 4KB XIP read cache and on-the-fly encryption and decryption
*   - Supports external serial memory initialization via 
*   <a href="https://www.jedec.org/standards-documents/docs/jesd216b" target="_blank">
*   Serial Flash Discoverable Parameters (SFDP)</a> standard
*
* The primary usage model for the SMIF is that of an external memory interface.
* The SMIF is capable of interfacing with different types of memory, up to four
* types.
*
* \b SMIF driver is divided into three layers
*   - cy_smif.h API
*   - cy_smif_memslot.h API
*   - SMIF configuration structures
*
* The SMIF API is divided into the low-level functions and memory-slot functions. Use
* the low level API for the SMIF block initialization and for implementing a generic 
* SPI communication interface using the SMIF block.
*
* The memory slot API has functions to implement the basic memory operations such as 
* program, read, erase etc. These functions are implemented using the memory 
* parameters in the memory device configuration data structure. The 
* Cy_SMIF_MemInit() API initializes all the memory slots based on the settings
* in the array.
*
* \image html smif_3_0_p01_layers.png
*
* \note
* Above image is applicable only for SMIF v3 IP.
*
* \image html smif_1_0_p01_layers.png
*
* \note
* Above image is applicable only for SMIF v1 IP.
*
* SMIF Configuration Tool is a stand-alone application, which is a part of PDL 
* (Creator) and could be found in \<PDL_DIR\>/tools/\<OS_DIR\>/SMIFConfigurationTool
* (e.g. for PDL 3.0.0 and Windows OS PDL/3.0.0/tools/win/SMIFConfigurationTool). 
* 
* In ModusToolbox this tool is called QSPI Configurator. QSPI Configurator is a part of 
* PSoC 6 Software Library and can be found in \<ModusToolbox\>/tools/qspi-configurator-1.1
*  
* Tool generates *.c and *.h file with configuration structures. These configuration
* structures are input parameters for cy_smif_memslot API level
*
* \warning The driver is not responsible for external memory persistence. You cannot edit
* a buffer during the Read/Write operations. If there is a memory error, the SMIF ip block 
* can require a reset. To determine if this has happened, check the SMIF 
* busy status using Cy_SMIF_BusyCheck() and implement a timeout. Reset the SMIF 
* block by toggling CTL.ENABLED. Then reconfigure the SMIF block.
*
* For the Write operation, check that the SMIF driver has completed 
* transferring by calling Cy_SMIF_BusyCheck(). Also, check that the memory is 
* available with Cy_SMIF_MemIsBusy() before proceeding. 
*
* Simple example of external flash memory programming using low level SMIF API.
* All steps mentioned in example below are incorporated in
* \ref Cy_SMIF_MemCmdWriteEnable(), \ref Cy_SMIF_MemCmdProgram(), and
* \ref Cy_SMIF_MemIsBusy() of the
* \ref group_smif_mem_slot_functions "memory slot level API".
* \warning Example is simplified, without checks of error conditions.
* \note Flash memories need erase operation before programming. Refer to
* external memory datasheet for specific memory commands.
*
* \snippet smif/snippet/main.c SMIF_API: Write example
*
* For the Read operation, before accessing the read buffer, check that it is ready
* by calling Cy_SMIF_GetTxFifoStatus().
*
* Simple example of external flash memory read using low level SMIF API. All
* steps mentioned in example below are incorporated in
* \ref Cy_SMIF_MemCmdRead() of the
* \ref group_smif_mem_slot_functions "memory slot level API".
* \warning Example is simplified, without checks of error conditions.
* \note Refer to external memory datasheet for specific memory commands.
*
* \snippet smif/snippet/main.c SMIF_API: Read example
*
* The user should invalidate the cache by calling Cy_SMIF_CacheInvalidate() when 
* switching from the MMIO mode to XIP mode.
*
* \section group_smif_configuration Configuration Considerations
*
* PDL API has common parameters: base, context, config described in
* \ref page_getting_started_pdl_design "PDL Design" section.
*
* See the documentation for Cy_SMIF_Init() and Cy_SMIF_MemInit() for details
* on the required configuration structures and other initialization topics. 
*
* The normal (MMIO) mode is used for implementing a generic SPI/DSPI/QSPI/dual
* QSPI/octal SPI communication interface using the SMIF block. This
* interface can be used to implement special commands like Program/Erase of
* flash, memory device configuration, sleep mode entry for memory devices or
* other special commands specific to the memory device. The transfer width
* (SPI/DSPI/QSPI/octal SPI) of a transmission is a parameter set for each
* transmit/receive operation. So these can be changed at run time.
*
* In a typical memory interface with flash memory, the SMIF is used in the
* memory mode when reading from the memory and it switches to the normal mode when
* writing to flash memory.
* A typical memory device has multiple types of commands.
*
* The SMIF interface can be used to transmit different types of commands. Each
* command has different phases: command, dummy cycles, and transmit and receive
* data which require separate APIs.
*
* \subsection group_smif_init SMIF Initialization
* Create interrupt function and allocate memory for SMIF context
* structure
* \snippet smif/snippet/main.c SMIF_INIT: context and interrupt
* SMIF driver initialization for low level API usage (cysmif.h)
* \snippet smif/snippet/main.c SMIF_INIT: low level
* Additional steps to initialize SMIF driver for memory slot level API usage
* (cy_smif_memslot.h).
* \snippet smif/snippet/main.c SMIF_INIT: memslot level
* \note Example does not include initialization of all needed configuration
* structures (\ref cy_stc_smif_mem_device_cfg_t, \ref cy_stc_smif_mem_cmd_t).
* SMIF/QSPI Configuration tool generates all configuration structures needed for
* memslot level API usage.
*
* \subsection group_smif_xip_init SMIF XIP Initialization
* The eXecute In Place (XIP) is a mode of operation where read or write commands 
* to the memory device are directed through the SMIF without any use of API 
* function calls. In this mode the SMIF block maps the AHB bus-accesses to 
* external memory device addresses to make it behave similar to internal memory. 
* This allows the CPU to execute code directly from external memory. This mode 
* is not limited to code and is suitable also for data read and write accesses.
* The memory regions available for XIP addresses allocation are defined
* in a linker script file (.ld).
*
* With SMIF V3 IP, MMIO mode transacations are also allowed when the device is set
* to XIP mode. However, only blocking SMIF API's are expected to be used for erase or
* program operations as external flash will be busy for such operation and may not be
* available for XIP at that moment. Blocking API's will ensure the transaction is complete
* and then switch back to XIP.
*
* \snippet smif/snippet/main.c SMIF_INIT: XIP
* \note Example of input parameters initialization is in \ref group_smif_init 
* section.
* \warning Functions that called from external memory should be declared with 
* long call attribute.  
*
* \subsection group_smif_xip_crypto SMIF XIP On-the-fly encryption
* In XIP mode, a cryptography component supports on-the-fly encryption for write data and
* on-the-fly decryption for read data. On-the-fly encryption/decryption in XIP mode can be
* enabled by setting the flags \ref CY_SMIF_FLAG_CRYPTO_ENABLE.
* Encryption  and  decryption  are  based  on  the  AES-128 forward block cipher: advanced
* encryption standard blockcipher with a 128-bit key. KEY[127:0] is a secret (private) key
* programmed into the CRYPTO_KEY3,...,CRYPTO_KEY0 registers using \ref Cy_SMIF_SetCryptoKey.
* These registers are software write-only. A software read returns 0. In the SMIF hardware,
* by applying AES-128 with KEY[127:0] on a plaintext PT[127:0], we get a ciphertext CT[127:0].
* In XIP mode, the XIP address is used as the plaintext PT[]. The resulting ciphertext CT[]
* is used on-the-fly and not software accessible. The XIP address is extended with the
* CRYPTO_INPUT3, ..., CRYPTO_INPUT0 registers. \ref Cy_SMIF_SetCryptoIV can be used to set
* initialization vector (96-bits).
* In XIP mode, the resulting ciphertext CT[] (of the encrypted address) is XORed with the memory
* transfers read data or write data. Note that the AES-128 block cipher is on the address of the
* data and not on the data itself.
*
* \image html smif_xip_mode_functionality.png
*
* \subsection group_smif_usage_rules Rules for PSoC6 QSPI/SMIF Block Usage
* 1. All operations must use one or more dummy cycles between the PSoC 6 Command 
* and Address phase (when the PSoC 6 MCU drives the data pins) and the device's 
* Response phase (when the device drives the same data pins). Bus contention may 
* occur if no (zero) dummy cycles are used.
* 2. Any transfer that does not allow dummy cycles (such as Register Status 
* Reads) must use the single-bit transfer mode. In single-bit mode, the PSoC 6 
* drives the Command on the Data0 line and the device responds on the Data1 
* line, so bus contention cannot occur.
*
* \section group_smif_more_information More Information
*
* More information regarding the Serial Memory Interface can be found in the component 
* datasheet and the Technical Reference Manual (TRM).
* More information regarding the SMIF Configuration Tool are in SMIF
* Configuration Tool User Guide located in \<PDL_DIR\>/tools/\<OS_DIR\>/SMIFConfigurationTool/
* folder
*
* \section group_smif_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td rowspan="5">2.30</td>
*     <td>Octal SDR and DDR support using SFDP mode.</td>
*     <td>Octal device support.</td>
*   </tr>
*   <tr>
*     <td>Move SFDP related functionality to cy_smif_sfdp.c. </td>
*     <td>Code Enhancements.</td>
*   </tr>
*   <tr>
*     <td>Added support for new product families</td>
*     <td>Support for CAT1B and CAT1C devices.</td>
*   </tr>
*   <tr>
*     <td>Added new API's:\n
*         \ref Cy_SMIF_MemInitSfdpMode()\n
*         \ref Cy_SMIF_SetCryptoIV()\n
*         \ref Cy_SMIF_SetCryptoKey()\n
*         \ref Cy_SMIF_ConvertSlaveSlotToIndex()\n
*         \ref Cy_SMIF_SetCryptoEnable()\n
*         \ref Cy_SMIF_SetCryptoDisable()\n
*         \ref Cy_SMIF_SetReadyPollingDelay()\n
*
*         Following macros renamed:\n
*         CY_SMIF_WRITE_STATUS_REG2_CMD to CY_SMIF_WRITE_STATUS_REG2_T1_CMD.</td>
*     <td>Support for SFDP 1.0 devices.</td>
*   </tr>
*   <tr>
*     <td>Added new API's for CAT1D devices\n
*         \ref Cy_SMIF_SetRxCaptureMode()\n
*         \ref Cy_SMIF_Bridge_Enable()\n
*         \ref Cy_SMIF_Bridge_SetPortPriority()\n
*         \ref Cy_SMIF_Bridge_SetSimpleRemapRegion()\n
*         \ref Cy_SMIF_Bridge_SetInterleavingRemapRegion()\n
*         \ref Cy_SMIF_MemOctalEnable()\n
      </td>
*     <td>Support for CAT1D devices.</td>
*   </tr>
*   <tr>
*     <td>2.20</td>
*     <td>Bug fixes in \ref Cy_SMIF_MemEraseSector for Hybrid memory configuration.
*         Updated \ref Cy_SMIF_MemIsReady to use \ref Cy_SysLib_Rtos_Delay and \ref Cy_SysLib_Rtos_DelayUs.</td>
*     <td>Code enhancement.</td>
*   </tr>
*   <tr>
*     <td>2.10</td>
*     <td>New silicon family support.</td>
*     <td>Added extended API for DDR support.</td>
*   </tr>
*   <tr>
*     <td rowspan="4">2.0</td>
*     <td>Reworked the \ref Cy_SMIF_MemRead and \ref Cy_SMIF_MemWrite functions to use polling instead of interrupts.</td>
*     <td>Extend the usability of these functions.</td>
*   </tr>
*   <tr>
*    <td>Reworked the length-parameter check in the \ref Cy_SMIF_MemEraseSector function.
*     The Erase operation is not performed and \ref CY_SMIF_SUCCESS is no longer returned when the sectors are not aligned.</td>
*     <td>Fix the user error-handling of the length parameter.</td>
*   </tr>
*   <tr>
*    <td>Fixed the address-parameter check in the \ref Cy_SMIF_MemLocateHybridRegion function.
*     \ref CY_SMIF_SUCCESS or \ref CY_SMIF_NOT_HYBRID_MEM is no longer returned when the address exceeds the memory size.</td>
*     <td>Address a defect.</td>
*   </tr>
*   <tr>
*     <td>Fixed MISRA 2012 violations.</td>
*     <td>MISRA 2012 compliance.</td>
*   </tr>
*   <tr>
*     <td>1.50.1</td>
*     <td>Minor documentation updates. </td>
*     <td>Documentation improvement. </td>
*   </tr>
*   <tr>
*     <td>1.50</td>
*     <td>Added a new function: \ref Cy_SMIF_MemLocateHybridRegion.\n
*     Added a new structure \ref cy_stc_smif_hybrid_region_info_t.\n
*     Updated the \ref Cy_SMIF_MemEraseSector and \ref Cy_SMIF_MemCmdSectorErase functions.\n
*     Updated the \ref Cy_SMIF_MemSfdpDetect function. \n
*     Updated the \ref cy_stc_smif_mem_device_cfg_t structure.</td>
*     <td>Support for memories with hybrid regions.</td>
*   </tr>
*   <tr>
*     <td rowspan="2">1.40.1</td>
*     <td>The \ref Cy_SMIF_MemInit is changed. </td>
*     <td>Corrected a false assertion during initialization in SFDP mode.</td>
*   </tr>
*   <tr>
*     <td>Minor documentation updates. </td>
*     <td></td>
*   </tr>
*   <tr>
*     <td rowspan="5">1.40</td>
*     <td>The following functions are renamed:\n
*        Cy_SMIF_GetTxfrStatus into Cy_SMIF_GetTransferStatus;\n
*        Cy_SMIF_Memslot_Init into Cy_SMIF_MemInit;\n
*        Cy_SMIF_Memslot_DeInit into Cy_SMIF_MemDeInit;\n
*        Cy_SMIF_Memslot_CmdWriteEnable into Cy_SMIF_MemCmdWriteEnable;\n
*        Cy_SMIF_Memslot_CmdWriteDisable into Cy_SMIF_MemCmdWriteDisable;\n
*        Cy_SMIF_Memslot_IsBusy into Cy_SMIF_MemIsBusy;\n
*        Cy_SMIF_Memslot_QuadEnable into Cy_SMIF_MemQuadEnable;\n
*        Cy_SMIF_Memslot_CmdReadSts into Cy_SMIF_MemCmdReadStatus;\n
*        Cy_SMIF_Memslot_CmdWriteSts into Cy_SMIF_MemCmdWriteStatus;\n
*        Cy_SMIF_Memslot_CmdChipErase into Cy_SMIF_MemCmdChipErase;\n
*        Cy_SMIF_Memslot_CmdSectorErase into Cy_SMIF_MemCmdSectorErase;\n
*        Cy_SMIF_Memslot_SfdpDetect into Cy_SMIF_MemSfdpDetect;\n
*        Cy_SMIF_Memslot_CmdProgram into Cy_SMIF_MemCmdProgram;\n
*        Cy_SMIF_Memslot_CmdRead into Cy_SMIF_MemCmdRead.\n
*          The following ENUMa are renamed:\n
*        CY_SMIF_SEND_CMPLT into CY_SMIF_SEND_COMPLETE;\n
*        CY_SMIF_REC_CMPLT into CY_SMIF_RX_COMPLETE;\n
*        CY_SMIF_REC_BUSY into CY_SMIF_RX_BUSY;\n
*        CY_SMIF_SEL_INV_INTERNAL_CLK into CY_SMIF_SEL_INVERTED_INTERNAL_CLK;\n
*        CY_SMIF_SEL_INV_FEEDBACK_CLK into CY_SMIF_SEL_INVERTED_FEEDBACK_CLK;\n
*        cy_en_smif_cache_en_t into cy_en_smif_cache_t.\n
*          The following MACROs are renamed:\n
*        CY_SMIF_FLAG_WR_EN into CY_SMIF_FLAG_WRITE_ENABLE;\n
*        CY_SMIF_FLAG_CRYPTO_EN into CY_SMIF_FLAG_CRYPTO_ENABLE;\n
*        CY_SMIF_SFDP_SING_BYTE_00 into CY_SMIF_SFDP_SIGNATURE_BYTE_00;\n
*        CY_SMIF_SFDP_SING_BYTE_01 into CY_SMIF_SFDP_SIGNATURE_BYTE_01;\n
*        CY_SMIF_SFDP_SING_BYTE_02 into CY_SMIF_SFDP_SIGNATURE_BYTE_02;\n
*        CY_SMIF_SFDP_SING_BYTE_03 into CY_SMIF_SFDP_SIGNATURE_BYTE_03;\n
*        CY_SMIF_WR_STS_REG1_CMD into CY_SMIF_WRITE_STATUS_REG1_CMD;\n
*        CY_SMIF_WR_DISABLE_CMD into CY_SMIF_WRITE_DISABLE_CMD;\n
*        CY_SMIF_RD_STS_REG1_CMD into CY_SMIF_READ_STATUS_REG1_CMD;\n
*        CY_SMIF_WR_ENABLE_CMD into CY_SMIF_WRITE_ENABLE_CMD;\n
*        CY_SMIF_RD_STS_REG2_T1_CMD into CY_SMIF_READ_STATUS_REG2_T1_CMD;\n          
*        CY_SMIF_WR_STS_REG2_CMD into CY_SMIF_WRITE_STATUS_REG2_CMD;\n
*        CY_SMIF_RD_STS_REG2_T2_CMD into CY_SMIF_READ_STATUS_REG2_T2_CMD;\n
*        CY_SMIF_QE_BIT_STS_REG2_T1 into CY_SMIF_QE_BIT_STATUS_REG2_T1;\n
*        CY_SMIF_STS_REG_BUSY_MASK into CY_SMIF_STATUS_REG_BUSY_MASK.\n
*      </td>
*      <td rowspan="2">Documentation improvement.</td>
*   </tr>
*   <tr>
*     <td>Updated the description of the Cy_SMIF_MemInit() function.
*         Updated the Cy_SMIF_Encrypt() function usage example.
*     </td>
*   </tr>
*   <tr>
*     <td>The type of arguments that are not modified by the functions are set to const.
*     </td>
*     <td>Usability improvement.
*     </td>
*   </tr>
*   <tr>
*     <td>The Cy_SMIF_MemSfdpDetect() function is updated to support new 
*         commands for 4 bytes addressing.
*     </td>
*     <td>Memory devices with new 4 byte addressing commands support.
*     </td>
*   </tr>
*   <tr>
*     <td>Added the blocking functions which take care of the 
*         busy-status check of the memory:
*         - \ref  Cy_SMIF_MemIsReady
*         - \ref  Cy_SMIF_MemIsQuadEnabled
*         - \ref  Cy_SMIF_MemEnableQuadMode
*         - \ref  Cy_SMIF_MemRead
*         - \ref  Cy_SMIF_MemWrite
*         - \ref  Cy_SMIF_MemEraseSector
*         - \ref  Cy_SMIF_MemEraseChip
*     </td>
*     <td>Added new high-level blocking functions.
*     </td>
*   </tr>
*   <tr>
*     <td rowspan="5">1.30</td>
*     <td>The CY_SMIF_CMD_FIFO_WR_RX_COUNT_Msk value is changed to 0x0000FFFFUL.</td>
*     <td rowspan="4">Driver maintenance.</td>
*   </tr>
*   <tr>
*     <td>Added the check of the size parameter in the Cy_SMIF_TransmitData() function.</td>
*   </tr>
*   <tr>
*     <td>Added conditional check for presence of the SMIF hardware IP.</td>
*   </tr>
*   <tr>
*     <td>Fixed the wrong erase command in the SFDP protocol for devices with Erase Type 3.</td>
*   </tr>
*   <tr>
*     <td>Updated the General Description section with minor changes.
*         Updated the ordering of the parameters descriptions for some functions.
*         Added the text saying that the Cy_SMIF_MemInit() function is applicable 
*      to use the external memory as memory-mapped to PSoC (XIP mode).
*         Added the snippet for the Cy_SMIF_Encrypt() function to show how to use this function.
*         Added below the picture in the Low-Level Functions section the sequence of PDL
*      functions required in a Read or Write transaction.
*         Added the text below the picture about the address.
*         Updated DUMMY COUNT in this picture.
*         Added checking of the size parameter in the Cy_SMIF_TransmitData() function.
*     </td>
*     <td>Documentation improvement.</td>
*   </tr>
*   <tr>
*     <td>1.20.1</td>
*     <td>Added upper limit to size parameter in several functions.</td>
*     <td>Documentation improvement.</td>
*   </tr>
*   <tr>
*     <td rowspan="3">1.20</td>
*     <td>Flattened the organization of the driver source code into the single 
*         source directory and the single include directory.
*     </td>
*     <td>Driver library directory-structure simplification.</td>
*   </tr>
*   <tr>
*     <td>Added a new return status and transfer width option for the case when the memory command is not supported.</td>
*     <td>Improved the memory command structure usability.</td>
*   </tr>
*   <tr>
*     <td>Added register access layer. Use register access macros instead
*         of direct register access using dereferenced pointers.</td>
*     <td>Makes register access device-independent, so that the PDL does 
*         not need to be recompiled for each supported part number.</td>
*   </tr>
*   <tr>
*     <td rowspan="2">1.11</td>
*     <td>Fixed internal function that writes to the SMIF FIFO</td>
*     <td>The write function stuck in the loop when write speed in external 
*         memory is significantly lower than PSoC CPU core speed and write 
*         transfer is not finished during the single function call.  
*     </td>
*   </tr>
*   <tr>
*     <td>Added optional mode part to the program command flow</td>
*     <td>Extend usability of program command</td>
*   </tr>
*   <tr>
*     <td>1.10.1</td>
*     <td>Added Low Power Callback section</td>
*     <td>Documentation update and clarification</td>
*   </tr>
*   <tr>
*     <td>1.10</td>
*     <td>Fix write to external memory from CM0+ core. Add checks of API input parameters. 
*         Minor documentation updates</td>
*     <td></td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_smif_macros Macros
* \{
* \defgroup group_smif_macros_status Status Macros
* \defgroup group_smif_macros_cmd Command Macros
* \defgroup group_smif_macros_flags External Memory Flags
* \defgroup group_smif_macros_sfdp SFDP Macros
* \defgroup group_smif_macros_isr Interrupt Macros
* \}
* \defgroup group_smif_functions Functions
* \{
* \defgroup group_smif_low_level_functions Low Level Functions
* \{
* The SMIF interface can be used to transmit different types of commands.
* Each command has different phases: command, dummy cycles, and transmit and receive data which require separate APIs.
*
* During the time that Slave Select line is active (LOW) the clock signal (CLK) is toggled while command information is first
* transferred on the data (IO) signals from the master to the slave. The clock continues to toggle during any period required for
* information access in the slave. The clock continues to toggle during the transfer of read data from the slave to the master
* or write data from the master to the slave. When the master has transferred the desired amount of data, the master drives the
* Slave Select line inactive (HIGH).
* Basic flow for read/write commands using \ref Cy_SMIF_TransmitCommand, \ref Cy_SMIF_TransmitData, \ref Cy_SMIF_ReceiveData and
* \ref Cy_SMIF_SendDummyCycles with a Quad SPI interface.
*
*  \image html smif_1_0_p03_rw_cmd.png
*
* The sequence of the PDL functions required in a read or write transaction is:
* \ref Cy_SMIF_TransmitCommand() -> 
* \ref Cy_SMIF_SendDummyCycles() -> 
* \ref Cy_SMIF_ReceiveData() / \ref Cy_SMIF_TransmitData() -> 
* \ref Cy_SMIF_BusyCheck().
* The address is sent as part of the Cy_SMIF_TransmitCommand() function. 
* No separate function call is required. 
*
* \}
* \defgroup group_smif_mem_slot_functions Memory Slot Functions
* \defgroup group_smif_functions_syspm_callback  Low Power Callback
* \}
* \defgroup group_smif_data_structures Data Structures
* \{
* \defgroup group_smif_data_structures_memslot SMIF Memory Description Structures
* General hierarchy of memory structures are:
*
* \image html smif_3_0_p02_memslot_stc.png
*
* \note
