RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_smif.h
/** Specifies the presence of the field. */
/**
* \note
* This enum is available for CAT1B, CAT1C and CAT1D devices.
**/
typedef enum
{
    CY_SMIF_NOT_PRESENT   = 0,
    CY_SMIF_PRESENT_1BYTE = 1,
    CY_SMIF_PRESENT_2BYTE = 2,
} cy_en_smif_field_presence_t;

/** Specifies the merge transaction timeout in terms of clock cycles. */
/**
* \note
* This enum is available for CAT1B, CAT1C and CAT1D devices.
**/
typedef enum
{
    CY_SMIF_MERGE_TIMEOUT_1_CYCLE      = 0,
    CY_SMIF_MERGE_TIMEOUT_16_CYCLES    = 1,
    CY_SMIF_MERGE_TIMEOUT_256_CYCLES   = 2,
    CY_SMIF_MERGE_TIMEOUT_4096_CYCLES  = 3,
    CY_SMIF_MERGE_TIMEOUT_65536_CYCLES = 4,
} cy_en_smif_merge_timeout_t;

#endif /* CY_IP_MXSMIF_VERSION */

#if (CY_IP_MXSMIF_VERSION>=5) || defined (CY_DOXYGEN)
/** Specifies the  PORT priority for XIP space. */
/**
* \note
* This enum is available for CAT1D devices.
**/

typedef enum
{
    CY_EN_BRIDGE_PRIO_SMIF0_XIP_SPACE = 0, // The master accessing through the SMIF0 XIP space has high priority.
    CY_EN_BRIDGE_PRIO_SMIF1_XIP_SPACE = 1, // The master accessing through the SMIF1 XIP space has high priority.
} cy_en_smif_bridge_xip_space_pri_t;

/** Specifies the XIP space. */
/**
* \note
* This enum is available for CAT1D devices.
**/

typedef enum
{
    CY_EN_BRIDGE_SMIF0_XIP_SPACE = 0,
    CY_EN_BRIDGE_SMIF1_XIP_SPACE = 1,
} cy_en_smif_bridge_xip_space_t;

/** Specifies the port priority on bridge interface. */
/**
* \note
* This structure is available for CAT1D devices.
**/

typedef struct
{
    cy_en_smif_bridge_xip_space_pri_t pri_ahb_smif0;  /**< This specifies the priority for AHB access over SMIF0 */
    cy_en_smif_bridge_xip_space_pri_t pri_ahb_smif1;  /**< This specifies the priority for AHB access over SMIF1 */
    cy_en_smif_bridge_xip_space_pri_t pri_axi_smif0;  /**< This specifies the priority for AXI access over SMIF0 */
    cy_en_smif_bridge_xip_space_pri_t pri_axi_smif1;  /**< This specifies the priority for AXI access over SMIF1 */
} cy_stc_smif_bridge_pri_t;

/** Specifies the remap type. */
/**
* \note
* This enum is available for CAT1D devices.
**/

typedef enum
{
    CY_EN_BRIDGE_REMAP_TYPE_INACTIVE   = 0,
    CY_EN_BRIDGE_REMAP_TYPE_TO_SMIF0   = 1,
    CY_EN_BRIDGE_REMAP_TYPE_TO_SMIF1   = 2,
    CY_EN_BRIDGE_REMAP_TYPE_INTERLEAVE = 3,
} cy_en_smif_bridge_remap_type_t;

/** Specifies the interleave size. */
/**
* \note
* This enum is available for CAT1D devices.
**/

typedef enum
{
    CY_EN_BRIDGE_INTERLEAVE_8BYTE   = 0,
    CY_EN_BRIDGE_INTERLEAVE_16BYTE  = 1,
    CY_EN_BRIDGE_INTERLEAVE_32BYTE  = 2,
    CY_EN_BRIDGE_INTERLEAVE_64BYTE  = 3,
    CY_EN_BRIDGE_INTERLEAVE_128BYTE = 4,
} cy_en_smif_bridge_interleave_step_t;

/** Specifies the remap size. */
/**
* \note
* This enum is available for CAT1D devices.
**/

typedef enum
{
    CY_EN_BRIDGE_REMAP_SIZE_1MB   = 0x1FF00000U,
    CY_EN_BRIDGE_REMAP_SIZE_2MB   = 0x1FE00000U,
    CY_EN_BRIDGE_REMAP_SIZE_4MB   = 0x1FC00000U,
    CY_EN_BRIDGE_REMAP_SIZE_8MB   = 0x1F800000U,
    CY_EN_BRIDGE_REMAP_SIZE_16MB  = 0x1F000000U,
    CY_EN_BRIDGE_REMAP_SIZE_32MB  = 0x1E000000U,
    CY_EN_BRIDGE_REMAP_SIZE_64MB  = 0x1C000000U,
    CY_EN_BRIDGE_REMAP_SIZE_128MB = 0x18000000U,
    CY_EN_BRIDGE_REMAP_SIZE_256MB = 0x10000000U,
    CY_EN_BRIDGE_REMAP_SIZE_512MB = 0x00000000U,
} cy_en_smif_bridge_remap_region_size_t;

/** Specifies the remap region information. */
/**
* \note
* This structure is available for CAT1D devices.
**/

typedef struct
{
    uint32_t                              regionIdx;   /**< This specifies the region index (0..8) */
    cy_en_smif_bridge_remap_region_size_t regionSize;  /**< This specifies the region size */
    uint32_t                              xipAddr;     /**< This specifies XIP address to be remapped */
    uint32_t                              phyAddr;     /**< This specifies target remapped address */
} cy_stc_smif_bridge_remap_t;

/** Specifies the interleaved memory region. */
/**
* \note
* This structure is available for CAT1D devices.
**/
typedef struct
{
    uint32_t                              regionIdx;       /**< This specifies the region index (0..8) */
    cy_en_smif_bridge_remap_region_size_t regionSize;      /**< This specifies the region size */
    uint32_t                              xipAddr;         /**< This specifies XIP address to be remapped */
    uint32_t                              phyAddr0;        /**< This specifies remapped address on PORT0 */
    uint32_t                              phyAddr1;        /**< This specifies remapped address on PORT1 */
} cy_stc_smif_bridge_interleave_remap_t;

#endif /* CY_IP_MXSMIF_VERSION */

/** \cond INTERNAL */
/*******************************************************************************
* These are legacy macros. They are left here just for backward compatibility.
* Do not use them in new designs.
*******************************************************************************/

#define CY_SMIF_SEND_CMPLT                          CY_SMIF_SEND_COMPLETE
#define CY_SMIF_REC_CMPLT                           CY_SMIF_RX_COMPLETE
#define CY_SMIF_REC_BUSY                            CY_SMIF_RX_BUSY
#define CY_SMIF_SEL_INV_INTERNAL_CLK                CY_SMIF_SEL_INVERTED_INTERNAL_CLK
#define CY_SMIF_SEL_INV_FEEDBACK_CLK                CY_SMIF_SEL_INVERTED_FEEDBACK_CLK
#define cy_en_smif_cache_en_t                       cy_en_smif_cache_t
#define Cy_SMIF_GetTxfrStatus                       Cy_SMIF_GetTransferStatus

/** \endcond */

/** \} group_smif_enums */


/**
* \addtogroup group_smif_data_structures
* \{
*/

/***************************************************************************//**
*
* The SMIF user callback function type called at the end of a transfer.
*
* \param event
* The event which caused a callback call.
*
*******************************************************************************/
typedef void (*cy_smif_event_cb_t)(uint32_t event);


/** The SMIF configuration structure. */
typedef struct
{
    uint32_t mode;              /**<  Specifies the mode of operation \ref cy_en_smif_mode_t. */
    uint32_t deselectDelay;     /**<  Specifies the minimum duration of SPI de-selection between SPI transfers:
                                *   - "0": 1 clock cycle.
                                *   - "1": 2 clock cycles.
                                *   - "2": 3 clock cycles.
                                *   - "3": 4 clock cycles.
                                *   - "4": 5 clock cycles.
                                *   - "5": 6 clock cycles.
                                *   - "6": 7 clock cycles.
                                *   - "7": 8 clock cycles. */
    uint32_t rxClockSel;        /**< Specifies the clock source for the receiver 
                                *  clock \ref cy_en_smif_clk_select_t. */
    uint32_t blockEvent;        /**< Specifies what happens when there is a Read  
                                * from an empty RX FIFO or a Write to a full 
                                * TX FIFO. \ref cy_en_smif_error_event_t. */
} cy_stc_smif_config_t;

